//两数组合并到新数组,本题是将数组a和b的数字存储进c数组中
//考点：数组的定义，使用，数组的起点编号（比如数组h[6],起始为h[0], 最后一个为h[5],数组中元素个数为6个）

#include<stdio.h>


int main()
{
//定义2个数组，并且初始化
    int a[5] = {1,3,5,6,8};
    int b[3] = {2,5,10};
    

//定义第三个数组并且初始化
    int c[10] = {0};//这样定义表示所有的元素都为0
    
    //将a置入第三个数组c中
    int i,n;
    for(i = 0; i < 5; i++)
    {
        c[i] = a[i];
    }
    n = i;//记录好c数组的下标
    
    //将b置入第三个数组c中
    for(i = 0; i < 3; i++)
    {
        c[i + n] = b[i];
    }
    
    //最后输出c数组，判断0则停止
    int j = 0;
    while(c[j] != 0)
    {
        printf("c[%d] = %d\n", j, c[j++]);
    }
    return 0;
}
